examples/consistency/windSandShockTube/Allrun
#!/usr/bin/env bash

source /opt/openfoam10/etc/bashrc
set -euo pipefail

case_dir="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"

cleanup()
{
    rc=$?
    "${case_dir}/assets/build/clean_validation_solver.sh" || true
    exit "${rc}"
}
trap cleanup EXIT

cd "${case_dir}"
./assets/initialization/prepare_axial_particles.py --check
./assets/build/build_validation_solver.sh
[[ -f constant/polyMesh/points ]] || blockMesh
export GAS_UGKP_CUDA_BACKEND="${case_dir}/.validation-bin/windSandUGKPCudaBackend"
"${case_dir}/.validation-bin/windSandUGKP"
